{
    "name": "Arin",
    "lastname": "Sinabian",
    "email": "arin.sinabian@gmail.com",
    "birthday": "1984-04-01T01:00:00",
    "en": {
        "role": "Full stack developer/Architect",
        "aboutMe": "I am a system architect with both backend and frontend experience. I started working as a developer in 2008 and have worked in different industries and in different countries. I am a creative developer who comes up with suggestions for functions and solutions myself. My strengths lie in my ability to communicate with other developers and customers/product owner and so on. I am very driven, analytical and positive. I am social and find it easy to make connections. I find it easy to learn new technology and methods for solving tasks. I think it's fun to spread my knowledge but also good at listening and taking in new knowledge.",
        "experince": [
            {
                
                "title": "Charge Amps",
                "icon": "/logo-charge-amps-large.png",
                "period": {
                    "from": "2022-02-01T00:00:00Z",
                    "to": null
                },
                "role": "Backend developer",
                "location": "Stockholm",
                "description": "saf",
                "tech": {
                    "server": [
                        "Microservices", "C#", "ASP.NET 6", "Proto.Actor", "Dapper", "SQL", "xUnit.NET", "Swashbuckle (Swagger)", "REST API", "MassTransit"
                    ],
                    "client": [

                    ],
                    "environment":[
                        "Azure", "Azure SQL", "Docker", "Kubernetes",  "Azure K8s", "Azure Redis", "RabbitMQ", "Kafka", "Azure Cosmos DB"
                    ],
                    "devops": [
                        "Azure DevOps", "Azure Container Registry", "GIT", "Azure Pipelines/Releases", "Kubernetes", "Helm", "Grafana", "Loki", "Tempo", "Prometheus"
                    ]
                }
            }
        ]
    },
    "sv": {
    
        "role": "Fullstackutvecklare/Arkitekt",
        "aboutMe": "Jag är systemarkitekt med både backend och frontend erfarenhet. Jag började jobba som utvecklare 2008 och har jobbat inom olika branscher och i olika länder. Jag är en kreativ utvecklare som själv kommer med förslag på funktioner och lösningar. Mina styrkor ligger i min förmåga att kommunicera med andra utvecklare och kunder/kravställare. Jag är mycket driven, analytisk och positivt lagd. Jag är social och har lätt för att knyta kontakter. Jag har lätt för att lära mig nya tekniker och metoder för att lösa uppgifter. Jag tycker att det är kul att sprida min kunskap men också bra på att lyssna och ta in ny kunskap.",
        "experince": [
            {
                "title": "Charge Amps",
                "icon": "/logo-charge-amps-large.png",
                "period": {
                    "from": "2022-02-01T00:00:00Z",
                    "to": null
                },
                "role": "Backendutvecklare",
                "location": "Stockholm",
                "description": "Charge Amps gör laddboxar till elbilar/laddhybrider. Olika team ansvarade för olika delar av Charge Amps molntjänst. Jag var i ett team som utvecklade OCPP server men jag bidrog till flera team. Min roll var att utveckla OCPP server som följer OCPP standarden för kommunikation mellan moln och laddbox. Där ingår bland annat att styra strömstyrkan under laddning. Balansera laddning mellan övrig förbrukning så säkringar inte går. Jag bidrog med min kunskap inom mikrotjänstarkitektur, enhetstestning, integrations testning. Jag satte upp nya mikrotjänster från grunden skrivna i .NET med Helm Charts deployade på Kubernetes. Jag lärde mig även nytt ramverk kallat Proto.Actor som är ett sätt utveckla applikationer distribuerat efter aktormodellen. OCPP server var utvecklat med Proto.Actor ramverket som gjorde det möjligt att skala till 100 000 laddboxar samtidigt utan problem.",
                "tech": {
                    "server": [
                        "Microservices", "C#", "ASP.NET 6", "Proto.Actor", "Dapper", "SQL", "xUnit.NET", "Swashbuckle (Swagger)", "REST API", "MassTransit"
                    ],
                    "client": [

                    ],
                    "environment":[
                        "Azure", "Azure SQL", "Docker", "Kubernetes",  "Azure K8s", "Azure Redis", "RabbitMQ", "Kafka", "Azure Cosmos DB"
                    ],
                    "devops": [
                        "Azure DevOps", "Azure Container Registry", "GIT", "Azure Pipelines/Releases", "Kubernetes", "Helm", "Grafana", "Loki", "Tempo", "Prometheus"
                    ]
                }
            },
            {
                "title": "Klara consulting",
                "icon": "/KC_logo_Black_payoff.svg",
                "period": {
                    "from": "2021-01-01T00:00:00Z",
                    "to": "2022-02-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare/Arkitekt",
                "location": "Stockholm",
                "description": "Klara Consulting hade utvecklat en portal åt sina kunder men saknade dokumentdelning mot sina kunder. Klara Consulting använde Sharepoint ut mot sina kunder men det var inte optimalt. Jag och UX fick rollen att ta reda på vad kraven var och vilken funktionalitet som fanns. UX tog fram design i Figma och tillsammans med användarna tog jag och UX fram kraven. Det befintliga systemet kördes i Kubernetes men var utvecklat som en monolit. Jag tog fram en mikrotjänstarkitektur där olika mikrotjänster ansvarade för affärsfunktioner. Jag gjorde även en tjänst som hanterade Sharepoint på ett enkelt sätt. Vilket möjliggjorde en dokumentdelning baserad på Office 365 för externa parter utan att man faktiskt använde SharePoint. Jag satte även upp CI/CD med Azure DevOps och Helm Charts.",
                "tech": {
                    "server": [
                        "Microservices", "Event driven", "C#", "ASP.NET 5", "Entity Framework Core", "SQL", "MSTest", "Swashbuckle (Swagger)", "REST API", "Microsoft Graph API", "MSAL"
                    ],
                    "client": [
                        "TypeScript", "Angular", "HTML", "SCSS", "Tailwind CSS", "Visual Studio Code"
                    ],
                    "environment":[
                        "Azure DevOps", "Azure Container Registry", "GIT", "Azure Pipelines/Releases", "Kubernetes", "Helm", "Terraform"
                    ],
                    "devops": [
                        "Docker", "Azure Kubernetes", "Azure Kubernetes", "Azure Redis", "Azure SQL", "Azure Service Bus", "RabbitMQ (lokal utv)", "Bridge to Kubernetes"
                    ]
                }
            },
            {
                "title": "Klarna (In-house Spree)",
                "icon": "/klarna.svg",
                "period": {
                    "from": "2021-05-01T00:00:00Z",
                    "to": "2021-11-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare/Arkitekt",
                "location": "Stockholm",
                "description": "Spree fick i uppdrag att lansera ett spel åt Klarna som skulle används internt för deras supportavdelning. Det var ett webbaserat spel skrivet i Unity. Min roll var att ta fram en arkitektur för backend som skulle hantera användare och resultat under spelets gång. Användare loggades in via Azure Active Directory B2C sedan skickades man in i spelet i webbläsaren. Jag ansvarade även att backend kunde hantera stora mängden anställda från olika delar av världen som skulle spela samtidigt. Jag använde mig av Azure CDN för att kunna leverera spelet på ca 200-300Mb till alla användare utan att belasta faktiska servern med spelet. Jag utvecklade även en styrning av spelet så det gick att göra ”event” av spelet så alla kunde komma in i spelet samtidigt vilket kunden behövde.",
                "tech": {
                    "server": [
                        "C# ASP.NET 5", "Azure Cosmos DB", "Swashbuckle (Swagger)", "REST API", "Docker", "MSAL"
                    ],
                    "client": [
                        "Angular", "TypeScript", "HTML", "SCSS", "Visual Studio Code"
                    ],
                    "environment":[
                        "Azure", "Azure Cosmos DB", "Azure CDN", "Azure Active Directory B2C", "Lasttestning (https://loadster.app/)"
                    ],
                    "devops": [
                        "Azure DevOps", "Azure Container Registry", "GIT", "Azure Pipelines/Releases"
                    ]
                }
            },
            {
                "title": "MTR via Spree",
                "icon": "/mtr.png",
                "period": {
                    "from": "2020-11-01T00:00:00Z",
                    "to": "2021-01-31T00:00:00Z"
                },
                "role": "Backendutvecklare",
                "location": "Stockholm",
                "description": "MTR Behövde hjälp med förvaltning och nyutveckling. Jag gick in som backendutvecklare men också som extra stöd åt frontend. Jag bidrog med kunskap i hur man kan skriva kod som är enkel att enhets testa i backend. Jag delade med mig av min erfarenhet och kunskap med teamet på distans via teams och på plats. Jag granskade både backend och frontend kod vid pull request. Jag satte även upp Azure SignalR och implementerade det i backend och visade för frontend utvecklarna hur man kunde använda det. Jag hade också tätt samarbete med testaren så buggar löstes snabbt. Jag gav förslag på förbättringar för Azure Devops pipelines och automatisk uppdatering av APIM vilket jag implementerade.",
                "tech": {
                    "server": [
                        "C#", "ASP.NET 5", "Entity Framework Core",".NET Core IoC", "NuGet", "SQL", "MSTest", "Swashbuckle (Swagger)", "REST API" 
                    ],
                    "client": [
                        "Angular", "TypeScript", "HTML", "SCSS", "Visual Studio Code"
                    ],
                    "environment":[
                        "Docker, Azure Kubernetes", "Azure API Managment","Cosmos DB", "Azure SignalR"
                    ],
                    "devops": [
                        "Azure DevOps", "Azure Container Registry", "GIT", "Azure Pipelines/Releases"
                    ]
                }
            },
            {
                "title": "World Expo 2020 (in-house Spree)",
                "icon": "/Expo-2020-logo.png",
                "period": {
                    "from": "2020-01-01T00:00:00Z",
                    "to": "2021-08-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare/Arkitekt",
                "location": "Stockholm",
                "description": "World Expo 2020 är en utställning som skulle hållas i Dubai 2020 (uppskjuten till 2021 p.g.a. covid-19) där länder visar upp den senaste inom teknik, utveckling, forskning o.s.v. Spree fick i uppdrag att utveckla en del av Sveriges utställning. Spree tog fram interaktiva lösningar i Unity och webb som skulle presentera Sverige och företagen som är utställare. Min roll i projektet var att utveckla ett webbaserat CMS som passade tekniskt de interaktiva Unity-stationerna och att ta fram en webapplikation för guiderna i utställningen. Jag jobbade i ett team på 10 personer där min roll var fullstackutvecklare och ansvarig för att Unity-utvecklarna enkelt kunde integrera mot CMS:et. Jag hade möte med utvecklarna dagligen för att stötta dom tekniskt. Jag såg till att CMS:et var enkelt att använda för expopartners och jag tog även fram hur gränssnittet skulle ut. Jag skissade på hur hela arkitekturen och integrationen skulle se ut mellan CMS och alla applikationer. Jag vår också ansvarig att utveckla en progressive web app för guiderna som skulle hjälpa besökarna.",
                "tech": {
                    "server": [
                        "C#", "ASP.NET Core 3.1", "Entity Framework Core", "SQL", "LINQ", ".NET Core IoC", "NuGet", "NUnit",  "Swashbuckle (Swagger)", "REST API"
                    ],
                    "client": [
                        "TypeScript", "Angular", "Material Design", "Flex Layout", "NPM", "HTML", "SCSS", "Visual Studio Code", "React", "Redux", "React Router"
                    ],
                    "environment":[
                        "Nginx", "Azure", "Azure SQL", "Azure App Service (Docker container), Docker Container"
                        
                    ],
                    "devops": [
                        "Bitbucket (Git)", "Docker hub", "Docker Container", "WSL 2", "Docker Compose (för utveckling)"
                    ]
                }
            },
            {
                "title": "Kone (in-house Spree)",
                "icon": "/KONE.svg",
                "period": {
                    "from": "2018-03-01T00:00:00Z",
                    "to": "2020-02-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare/Arkitekt",
                "location": "Stockholm",
                "description": "Kone behövde ett verktyg för att stödja verksamheten från sälj till en färdig hiss. Jag hjälpte Kone att vidareutveckla verktyget SET (Sales and Engineering Tool). Syftet med systemet är att förenkla och vägleda olika roller i Kone genom processen från sälj till ett bygge av en hiss. Kraven var inte spikade utan togs fram under utveckling med mig och kunden tillsammans och släpptes löpande. Min roll var att utveckla systemet och att leda ett team på 3 utvecklare där jag planerade sprintar med en UX/ Projektledare med täta releaser på ca 2 - 4 veckor. Jag avlastade utvecklarna från DevOps bitarna så utvecklarna kunde fokusera på utveckling. Tex så tog Jag fram script för utvecklarna så manuellt processer skulle automatiseras. Jag och projektledaren hade tillsammans möte med kund regelbundet för att samla in krav från kunden inför varje release. Jag gav också förslag på funktioner till Kone och många av förslagen implementerades och uppskattades av Kone. Jag introducerade CI/CD för teamet för att förbättra kvalitén av nya versions släpp. Jag hjälpte även utvecklarna genom att göra skisser på arkitekturen så utvecklarna enklare kunde utveckla nya funktioner. SET används idag av Kone Sverige och Kone Norge och Kone är så pass nöjda att det även Danmark står på tur att få använda systemet.",
                "tech": {
                    "server": [
                        "ASP.NET 4.7", "ASP.NET Core", "ASP.NET Web API", "ASP.NET Core MVC", "Entity Framework", "SQL", "LINQ", "Autofac", "NuGet", "REST API"
                    ],
                    "client": [
                        "TypeScript", "Angular", "Material Design", "Flex Layout", "NPM", "HTML", "SCSS", "Visual Studio Code", "E2E test Protractor", "Jasmin"
                    ],
                    "environment":[
                        "Azure", "Azure SQL", "Azure App Service", "Azure Logic Apps", "Azure Search", "Azure AD", "Azure Storage", "Visual Studio 2019" 
                        
                    ],
                    "devops": [
                        "AppVeyor", "Bitbucket (Git)", "PowerShell (deploy, DevOps)", "Angular CLI (Webpack)"
                    ]
                }
            },
            {
                "title": "Symbrio (Konsult via Spree)",
                "icon": "/symbrio.svg",
                "period": {
                    "from": "2016-11-01T00:00:00Z",
                    "to": "2018-03-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare",
                "location": "Stockholm",
                "description": "Symbrio är ett företag som utvecklar faktureringssystem för byggbranschen. Både företag som är inköpare och återförsäljare/leverantörer är kunder hos Symbrio och använder systemet. Min roll var att gå in som frontend konsult för att lyfta Symbrios användargränssnit. Lyftet gjordes med teknisk hjälp av Angular och konfigurering av CI/CD för Angular i Jenkins. Jag jobbade tätt med andra backendutvecklare och en grafiskdesigner för att knyta ihop den nya designen och flödet med backend. Jag spred även kunskap om Angular inom teamet. Jag och den grafiska designern hade tät dialog om möjligheterna och jag kom med förslag på förbättringar i gränssnittet. Teamet jag jobbade med bestod av 7 utvecklare, 1 designer och 2 testare. Teamet delades upp efter krav/funktioner och då beroende på krav så kunde jag jobba med 1 - 2 utvecklare och 1 testare. Jag hade även en workshop med Symbrios utvecklare där vi byggde en varningslampa när något byggsteg i Jenkins misslyckades. Vi använde sig av NodeMCU som styrde relän. Den lilla workshopen uppskattades verkligen av Symbrios utvecklare.",
                "tech": {
                    "server": [
                        "C#", "Web API ASP.NET", "WebSockets", "NHibernate", "SQL"
                    ],
                    "client": [
                        "TypeScript", "JavaScript", "Angular", "AngularJS (fasades ut)", "HTML", "CSS", "Bootstrap", "LESS", "Webforms (fasades ut mot angular)"
                    ],
                    "environment":[
                        "IIS", "Windows Server 2012", "SQL Server 2012", "Visual Studio 2017", "Visual Studio Code", "TFS", "NPM"
                    ],
                    "devops": [
                        "Jenkins", "TFS", "Angular CLI", "Webpack"
                    ]
                }
            },
            {
                "title": "Logivia/Visma (Konsult via Spree)",
                "icon": "/visma.svg",
                "period": {
                    "from": "2015-09-01T00:00:00Z",
                    "to": "2016-11-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare",
                "location": "Stockholm",
                "description": "Logivia är ett IT bolag som utvecklar logistiksystem och har ett samarbete med Visma. Systemet hanterar beställningar av transporter och med hjälp av systemet ska kunden snabba upp sin planering av transporter. Systemet kan planera och optimera körningar/hämtningar och även visa dessa i realtid och varna om något går snett. Teamet jag jobbade med bestod av 4 utvecklare, 1 testare och en projektledare. Jag fick utveckla flera olika delar av systemet i hela stacken från databas till HTML och JavaScript där jag även fick ta fram komponenter för användargränssnittet. Jag var stöd speciellt för frontendutvecklingen där jag delade med mig av kunskap till det andra. Eftersom design eller flöde inte fanns tog jag fram förslag som jag själv implementerade.",
                "tech": {
                    "server": [
                        "MVC 5 .NET C#", "Entity Framework 6", "WCF", "Web Services"
                    ],
                    "client": [
                        "JavaScript", "Knockout.js", "HTML", "CSS",  "Bootstrap", "LESS"
                    ],
                    "environment":[
                        "IIS", "Windows Server 2012", "SQL server 2012", "Visual Studio 2013", "TFS"
                    ]
                }
            },
            {
                "title": "Klustr (inhouse projekt Spree)",
                "icon": null,
                "period": {
                    "from": "2015-01-01T00:00:00Z",
                    "to": "2015-08-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare",
                "location": "Stockholm",
                "description": "Min roll i projektet var att driva och planera beckendutveckling. Backend bestod av ett REST API som Klustr appen (iOS och Android) kommunicerade med. Eftersom jag var den enda backendutvecklare tog jag mycket ansvar och planerade sitt arbete tillsammans med de andra två apputvecklarna. Teamet bestod i 2 apputvecklare, 1 testare och tillsammans med mig som backendutvecklare tog vi fram Klustr appen. Backend bestod också av Cloud Service som körde uppdatering av användarnas data och kommunicerade via Service Bus till Azure App Service. Jag valde denna uppdelning så tunga körningar skulle köras i Cloud Service för att lasta av Azure App Service som endast skulle hantera API anrop. Jag tog fram delar av den arkitekturen.",
                "tech": {
                    "server": [
                        "Web API 2 .NET", "C#", "OAuth", "Entity Framework 6"
                    ],
                    "client": [
                        
                    ],
                    "environment":[
                        "Visual Studio 2015", "Azure Web app", "Azure Cloud Service", "Azure Service Bus", "Azure Storage", "Azure SQL Server", "MSTest"
                    ],
                    "devops": [
                        "SVN", "TeamCity"
                    ]
                }
            },
            {
                "title": "Flygstolar.se/ATE (inhouse på M-Bition)",
                "icon": "flygstolar.png",
                "period": {
                    "from": "2014-01-01T00:00:00Z",
                    "to": "2014-12-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare",
                "location": "Stockholm",
                "description": "När jag jobbade på M-bition som ägde tjänsten ATE och flygstolar.se så jobbade jag med att vidareutveckla ATE som är en prisjämförelsemotor för flygresor och hotell. ATE var alltså en SaaS-tjänst som användes av andra sajter. ATE hämtar in priser från flera resebyråer och sammanställer data för att sedan kunna presenteras av en resesajt som använder ATE. Användare kan då söka efter det billigaste flyg eller hotellpriset från den resebyrå kunden föredrar. Min roll var att vidareutveckla tjänsten med hotellsök och lägga in nya resebyråer i prisjämförelsemotorn. Jag gjorde även förbättringar i arkitekturen för att enklare kunna lägga in fler resebyråer.",
                "tech": {
                    "server": [
                        "MVC 3 .NET", "C#", "Web Forms", "WCF", "Web Services", "ETL"
                    ],
                    "client": [
                        "JavaScript", "CSS", "Knockout.js", "Bootstrap","HTML"
                    ],
                    "environment":[
                        "IIS", "Windows Server 2008", "Windows Server 2012", "SQL Server 2008", "Visual Studio 2012", "SVN"
                    ],
                    "devops": [
                        
                    ]
                }
            },
            {
                "title": "Tele2 (Konsult via M-Bition)",
                "icon": "Tele2_logo.svg",
                "period": {
                    "from": "2011-12-01T00:00:00Z",
                    "to": "2014-01-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare",
                "location": "Stockholm",
                "description": "Jag arbetade i ett SCRUM team med cirka 20 personer uppdelade i front och backend team. Min uppgift var att stödja frontend teamet med att utveckla och underhålla webbutiken skriven i C# med ASP.NET Web Forms. TeamCity användes för att bygga, deploya och köra tester för frontend. Jag jobbade tätt med marknadsavdelning där jag tog eget ansvar och kommunicerade tydligt med marknad så resultat blev som förväntat. Jag jobbade också med konfiguration av olika typer av servrar och utbildade kollegor hur man konfigurerar dessa. Jag gav förslag att byta ut jQuery mot AngularJS för att förenkla utveckling av gränssnittet och öka på möjligheterna vilket gjordes med gott resultat.",
                "tech": {
                    "server": [
                        "ASP .NET", "C#", "OpenText CMS"
                    ],
                    "client": [
                        "JavaScript","HTML", "CSS", "jQuery", "AngularJS"
                    ],
                    "environment":[
                        "IIS", "Linux", "SVN", "Git", "Windows Server", "Visual Studio 2010", "TeamCity", "REHL", "Apache HTTP Server", "Memcached", "PHP", "MySQL", "Magento"
                    ],
                    "devops": [
                        
                    ]
                }
            },
            {
                "title": "Bahnhof (Konsult via Netlight)",
                "icon": "bahnhof.svg",
                "period": {
                    "from": "2011-06-01T00:00:00Z",
                    "to": "2011-12-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare",
                "location": "Stockholm",
                "description": "Jag jobbade med att bygga ut Bahnhofs administration system för telefonväxlar. Min roll var att integrera mot SNPACs API så Bahnhofs administration system skulle kunna utföra porteringar enklare. Tyvärr blev jag inte klar med det uppdraget utan lämnade över den till en kollega som slutförde integrationen. Jag la grunden för integrationen och det var enkelt för kollegan att ta över och slutföra arbetet.",
                "tech": {
                    "server": [
                        "Java", "Ruby on Rails"
                    ],
                    "client": [
                        "JavaScript", "CSS", "HTML"
                    ],
                    "environment":[
                        "Linux", "SVN", "Git", "Vim", "RubyMine"
                    ],
                    "devops": [
                        
                    ]
                }
            },
            {
                "title": "SCM Ventures (Konsult via Netlight)",
                "icon": "blocket.svg",
                "period": {
                    "from": "2011-04-01T00:00:00Z",
                    "to": "2011-06-01T00:00:00Z"
                },
                "role": "Frontendutvecklare",
                "location": "Stockholm",
                "description": "SCM Ventures är en del av blocket.se mot utländska marknaden.  Min roll var som webbutvecklare att utveckla HTML, CSS, JavaScript för ”feature phones” (äldre telefoner). Målet var att få ut en enkel version av blocket för indiska marknaden. Blocket visste inte vilka begräsningar som fanns i ”feature phones” vilket jag löste utmaningen genom att hitta statistik för de telefoner som var vanligast i Indien och att installera och dokumentera emulatorer för dessa. Detta arbete kunde blocket använda för att vidareutveckla i andra länder där dessa emulatorer behövdes. Jag jobbade självständigt i denna roll men kommunicerade med andra utvecklare inom SCM Ventures.",
                "tech": {
                    "server": [
                        "PHP", "Blocket Templating"
                    ],
                    "client": [
                        "JavaScript", "CSS","HTML" 
                    ],
                    "environment":[
                        "Linux", "Bazar versionshantering", "Vim"
                    ],
                    "devops": [
                        
                    ]
                }
            },
            {
                "title": "Media Norge Digital (Konsult via Netlight)",
                "icon": "schibsted-logo-vector-xs.png",
                "period": {
                    "from": "2010-10-01T00:00:00Z",
                    "to": "2011-04-01T00:00:00Z"
                },
                "role": "Systemutvecklare",
                "location": "Oslo",
                "description": "Jag bodde och konsultade i Oslo i ca 8 månader eftersom jag fått ett uppdrag på Media Norge digital. MNO är en del av Schibsteds Digital avdelningar där utvecklingen av Schibsteds tidningar i Norge drivs (aftenposten.no, bt.no, aftenbladet.no med flera). Min roll var att hjälpa till att utveckla nya versioner av dessa sajter. Teamet jag jobbade i insåg att genom att utveckla ett gemensamt frontend ramverk för alla tidningar så skulle man spara mycket tid. Jag var med och tog fram ramverket tillsammans med MNOs utvecklare. bt.no lanserade först med ramverket för att sedan fortsätta med Aftenposten och Aftenbladet. Ramverket som utvecklades gjorde det mycket enklare för resterande tidningar att gå över till nya CMS:et Escenic. Jag jobbade enligt SCRUM med 3 frontend utvecklare och 5 andra backendutvecklare.",
                "tech": {
                    "server": [
                        "JSP", "Escenic"
                    ],
                    "client": [
                        "JavaScript","HTML", "CSS", "jQuery", "require.js" 
                    ],
                    "environment":[
                        "Linux Debian", "Tomcat", "Intellij IDE", "SVN"
                    ],
                    "devops": [
                        
                    ]
                }
            },
            {
                "title": "TELE2/COMVIQ (Konsult via Done Interactive)",
                "icon": "comviq.png",
                "period": {
                    "from": "2009-10-01T00:00:00Z",
                    "to": "2010-10-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare",
                "location": "Stockholm",
                "description": "Jag jobbade som konsult på TELE2/COMVIQ där jag fick stödja COMVIQ team. Jags roll var att utveckla funktioner som marknadsavdelningen prioriterade.  T.ex. tanka kontantkortfunktion med integration till en betallösning för att förenkla för COMVIQ kunder att fylla på kontantkort via webben. Jag hoppade även in som extra stöd och hjälpte till med att utveckla TELE2 företagsshopen. Jag fick jobba i ett SCRUM team på 10 personer med daily standups och retros. Jag fick också ta fram backend och frontend arkitekturen för Comviqs nya sajt som skrevs i .NET och JavaScript.",
                "tech": {
                    "server": [
                        "ASP. NET", "C#", "Web Services", "LiveServer"
                    ],
                    "client": [
                        "jQuery", "AJAX", "JavaScript", "JSON", "HTML", "CSS"
                    ],
                    "environment":[
                        "Linux", "OpenText Reddot (CMS)", "Windows Server 2008", "IIS", "Apache Tomcat (LiveServer)", "Visual Studio 2010", "SVN"
                    ],
                    "devops": [
                        
                    ]
                }
            },
            {
                "title": "Done Interactive",
                "icon": null,
                "period": {
                    "from": "2009-08-01T00:00:00Z",
                    "to": "2010-10-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare",
                "location": "Stockholm",
                "description": "Jag jobbade som fullstackutvecklare på Done Interactive. Jag jobbade med att utveckla kampanj och företagssajter och system åt kunder. Däribland kunder som Comviq, Blossa, Eurosport och andra kända varumärken. Kunderna jag jobbade med uppskattade min snabbhet och kommunikation.",
                "tech": {
                    "server": [
                        "ASP .NET", "C#", "SQL", "PHP", "Web Services"
                    ],
                    "client": [
                        "jQuery", "AJAX", "JavaScript", "JSON", "HTML", "CSS"
                    ],
                    "environment":[
                        "IIS", "Windows", "Visual Studio 2008", "SQL Server 2008", "Adobe Photoshop", "SVN"
                    ],
                    "devops": [
                        
                    ]
                }
            },
            {
                "title": "Fastcheck",
                "icon": null,
                "period": {
                    "from": "2008-04-01T00:00:00Z",
                    "to": "2009-08-01T00:00:00Z"
                },
                "role": "Fullstackutvecklare",
                "location": "Stockholm",
                "description": "Fastcheck är ett företag som tillhandahåller reseguider i PDF format för nedladdning. Min roll var att integrera partnersidor med fastchecks nedladdning system och utveckla den egna sajten. Jag tog även fram en ny integrationsmetod som gjorde det lättare för icke teknisk personal att på kort tid ta fram en ny integration åt partners så man snabbare kunde få spridning av reseguiderna.",
                "tech": {
                    "server": [
                        
                    ],
                    "client": [
                        
                    ],
                    "environment":[
                        
                    ],
                    "devops": [
                        
                    ]
                }
            },
            {
                "title": "Hewlett Packard (Praktik via Tongji University)",
                "icon": "hp-hewlett-packard.svg",
                "period": {
                    "from": "2008-01-01T00:00:00Z",
                    "to": "2008-06-01T00:00:00Z"
                },
                "role": "Systemutvecklare",
                "location": "Shanghai",
                "description": "Jag bodde i Shanghai och praktiserade på HP i 5 månader via Tongji University där jag var utbytesstudent. Jag var med och utvecklade ett felrapporteringssystem som används internt då hårdvara gick sönder eller inte fungerade. Jag jobbade i team på 3 personer vilket betydde mycket eget ansvar. Jag drev även kurs i JavaScript för mina kollegor som ville lära sig mer om frontend utveckling. ",
                "tech": {
                    "server": [
                        
                    ],
                    "client": [
                        
                    ],
                    "environment":[
                        
                    ],
                    "devops": [
                        
                    ]
                }
            }
        ]
    
    },
    "skills":[
        {
            "name": ".NET/.NET Core",
            "level": 90
        
        },
        {
            "name": "C#",
            "level": 90
        },
        {
            "name": "SQL",
            "level": 70
        },
        {
            "name": "JavaScript",
            "level": 90
        },
        {
            "name": "TypeScript",
            "level": 90
        },
        {
            "name": "React",
            "level": 70
        },
        {
            "name": "Linux",
            "level": 60
        },
        {
            "name": "Kubernetes",
            "level": 60
        },
        {
            "name": "Helm",
            "level": 60
        },
        {
            "name": "CI/CD",
            "level": 80
        },
        {
            "name": "Microservices",
            "level": 80
        },
        {
            "name": "Message brokers RabbitMQ, Service Bus, Kafka",
            "level": 60
        },
        {
            "name": "Azure",
            "level": 70
        },
        {
            "name": "Angular",
            "level": 80
        },
        {
            "name": "HTML,CSS, SASS",
            "level": 70
        },
        {
            "name": "Docker",
            "level": 60
        },
        {
            "name": "Cosmos DB",
            "level": 70
        }


    ]
}